wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gpio.h
// 4. PortX功能选择寄存器								
#define	GPIOx_FCR_Px15FCR_Pos	30	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px15FCR_Msk	(0x03U << GPIOx_FCR_Px15FCR_Pos)
								//Px[15]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function								
#define	GPIOx_FCR_Px14FCR_Pos	28	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px14FCR_Msk	(0x03U << GPIOx_FCR_Px14FCR_Pos)
								//Px[14]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function
#define	GPIOx_FCR_Px13FCR_Pos	26	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px13FCR_Msk	(0x03U << GPIOx_FCR_Px13FCR_Pos)
								//Px[13]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function
#define	GPIOx_FCR_Px12FCR_Pos	24	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px12FCR_Msk	(0x03U << GPIOx_FCR_Px12FCR_Pos)
								//Px[12]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function
#define	GPIOx_FCR_Px11FCR_Pos	22	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px11FCR_Msk	(0x03U << GPIOx_FCR_Px11FCR_Pos)
								//Px[11]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function
#define	GPIOx_FCR_Px10FCR_Pos	20	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px10FCR_Msk	(0x03U << GPIOx_FCR_Px10FCR_Pos)
								//Px[10]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//10：Analog function
#define	GPIOx_FCR_Px9FCR_Pos	18	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px9FCR_Msk	(0x03U << GPIOx_FCR_Px9FCR_Pos)
								//Px[9]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function	
#define	GPIOx_FCR_Px8FCR_Pos	16	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px8FCR_Msk	(0x03U << GPIOx_FCR_Px8FCR_Pos)
								//Px[8]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function
#define	GPIOx_FCR_Px7FCR_Pos	14	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px7FCR_Msk	(0x03U << GPIOx_FCR_Px7FCR_Pos)
								//Px[7]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function
#define	GPIOx_FCR_Px6FCR_Pos	12	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px6FCR_Msk	(0x03U << GPIOx_FCR_Px6FCR_Pos)
								//Px[6]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function
#define	GPIOx_FCR_Px5FCR_Pos	10	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px5FCR_Msk	(0x03U << GPIOx_FCR_Px5FCR_Pos)
								//Px[5]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function
#define	GPIOx_FCR_Px4FCR_Pos	8	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px4FCR_Msk	(0x03U << GPIOx_FCR_Px4FCR_Pos)
								//Px[4]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function
#define	GPIOx_FCR_Px3FCR_Pos	6	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px3FCR_Msk	(0x03U << GPIOx_FCR_Px3FCR_Pos)
								//Px[3]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function
#define	GPIOx_FCR_Px2FCR_Pos	4	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px2FCR_Msk	(0x03U << GPIOx_FCR_Px2FCR_Pos)
								//Px[2]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function
#define	GPIOx_FCR_Px1FCR_Pos	2	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px1FCR_Msk	(0x03U << GPIOx_FCR_Px1FCR_Pos)
								//Px[1]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function
#define	GPIOx_FCR_Px0FCR_Pos	0	//R/W: rw	ResetValue: 0x0
#define	GPIOx_FCR_Px0FCR_Msk	(0x03U << GPIOx_FCR_Px0FCR_Pos)
								//Px[0]引脚功能选择
								//00：GPIO输入
								//01：GPIO输出
								//10：Digital function
								//11：Analog function	

// 5. PortX输出数据寄存器																						
#define	GPIOx_DO_DO_Pos	0	//R/W: rw	ResetValue: 0x0
#define	GPIOx_DO_DO_Msk	(0xffffU << GPIOx_DO_DO_Pos)
								//GPIO output data register

// 6. PortX输出数据置位寄存器								
#define	GPIOx_DSET_DSET_Pos	0	//R/W: rw	ResetValue: 0x0
#define	GPIOx_DSET_DSET_Msk	(0xffffU << GPIOx_DSET_DSET_Pos)
								//GPIO output data set register
								//举例：向PADSET写0x0000_8000，则PADOR[15]置位，其余位保持不变。
								//PASET/PBSET为16位；PCSET/PDSET为13位

// 7. PortX输出数据复位寄存器								
#define	GPIOx_DRST_DRESET_Pos	0	//R/W: rw	ResetValue: 0x0
#define	GPIOx_DRST_DRESET_Msk	(0xffffU << GPIOx_DRST_DRESET_Pos)
								//GPIO output data reset register
								//举例：向PADRST写0x0000_8000，则PADOR[15]清零，其余位保持不变
								//PASET/PBSET为16位；PCSET/PDSET为13位

// 8. PortX输入数据寄存器																																															
#define	GPIOx_DIN_DIN_Pos	0	//R/W: rw	ResetValue: 0x0
#define	GPIOx_DIN_DIN_Msk	(0xffffU << GPIOx_DIN_DIN_Pos)
								//Portx input data register
								//此寄存器仅占用地址空间，无物理实现。
								//软件读此寄存器直接返回引脚输入信号，芯片并不对引脚输入进行锁存

// 9. PortX额外数字功能寄存器								
#define	GPIOx_DFS_DFS_Pos	0	//R/W: rw	ResetValue: 0x0
#define	GPIOx_DFS_DFS_Msk	(0xffffU << GPIOx_DFS_DFS_Pos)
								//Portx Digital Function Select
								//对于具有多个数字外设功能的引脚，通过PxDFS寄存器可以选择使用哪个外设功能。
								//注意，对于不同的IO分组，有效的寄存器位置是不一样的

// 10. PortX强驱动使能寄存器								
#define	GPIOx_HD_HD_Pos	0	//R/W: rw	ResetValue: 0x0
#define	GPIOx_HD_HD_Msk	(0xffffU << GPIOx_HD_HD_Pos)
								//PortX High Drive Enable
								//1：使能IO强驱动
								//0：关闭IO强驱动
								//注：支持强驱动的IO有PA11/12、PD0/1/11；有效的物理寄存器有PAHD[11], PAHD[12], PDHD[0], PDHD[1], PDHD[11]；其余寄存器无意义。								

// 11. PortX模拟开关使能寄存器								
#define	GPIOx_ANEN_ANEN_Pos	0	//R/W: rw	ResetValue: 0x0
#define	GPIOx_ANEN_ANEN_Msk	(0xffffU << GPIOx_ANEN_ANEN_Pos)
								//PortX 模拟开关使能
								//1：使能IO模拟开关
								//0：关闭IO模拟开关
								//注：支持模拟开关的IO有
								//PA6/PA7/PA13/PA14/PA15
								//PB0/PB1/PB13/PB14/PB15
								//PC0/PC1/PC6/PC7/PC8/PC9/PC10
								//PD0/PD1/PD2/PD11/PD12
								//对应以上IO的PxANEN寄存器有效；其余寄存器无意义。

// 12. EXTI输入选择寄存器								
#define	GPIO_EXTI_SEL_DSEL_Pos			24	//R/W: rw	ResetValue: 0x0
#define	GPIO_EXTI_SEL_DSEL_Msk			0x3FU << GPIO_EXTI_SEL_DSEL_Pos
								//PortD EXTI中断输入选择
								//EXTI_DSEL[5:4] 
								//00：PD8
								//01：PD9
								//10：PD10
								//11：PD11
								//EXTI_DSEL[3:2] 
								//00：PD4
								//01：PD5
								//10：PD6
								//11：PD7
								//EXTI_DSEL[1:0] 
								//00：PD0
								//01：PD1
								//10：PD2
								//11：PD3
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_SEL_CSEL_Pos			16	//R/W: rw	ResetValue: 0x0
#define	GPIO_EXTI_SEL_CSEL_Msk			0x3FU << GPIO_EXTI_SEL_CSEL_Pos
								//PortC EXTI中断输入选择
								//EXTI_CSEL[5:4] 
								//00：PC8
								//01：PC9
								//10：PC10
								//11：PC11
								//EXTI_CSEL[3:2] 
								//00：PC4
								//01：PC5
								//10：PC6
								//11：PC7
								//EXTI_CSEL[1:0]  
								//00：PC0
								//01：PC1
								//10：PC2
								//11：PC3
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_SEL_BSEL_Pos			8	//R/W: rw	ResetValue: 0x0
#define	GPIO_EXTI_SEL_BSEL_Msk			0xFFU << GPIO_EXTI_SEL_BSEL_Pos
								//PortB EXTI中断输入选择
								//EXTI_BSEL[7:6] 
								//00：PB12
								//01：PB13
								//10：PB14
								//11：PB15
								//EXTI_BSEL[5:4] 
								//00：PB8
								//01：PB9
								//10：PB10
								//11：PB11
								//EXTI_BSEL[3:2] 
								//00：PB4
								//01：PB5
								//10：PB6
								//11：PB7
								//EXTI_BSEL[1:0]  
								//00：PB0
								//01：PB1
								//10：PB2
								//11：PB3
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_SEL_ASEL_Pos			0	//R/W: rw	ResetValue: 0x0
#define	GPIO_EXTI_SEL_ASEL_Msk			0xFFU << GPIO_EXTI_SEL_ASEL_Pos
								//PortA EXTI中断输入选择
								//EXTI_ASEL[7:6] 
								//00：PA12
								//01：PA13
								//10：PA14
								//11：PA15
								//EXTI_ASEL[5:4] 
								//00：PA8
								//01：PA9
								//10：PA10
								//11：PA11
								//EXTI_ASEL[3:2] 
								//00：PA4
								//01：PA5
								//10：PA6
								//11：PA7
								//EXTI_ASEL[1:0]  
								//00：PA0
								//01：PA1
								//10：PA2
								//11：PA3
								//

