wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gpio.h
// 13. EXTI边沿选择和使能寄存器								
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI15_EDS_Pos		30	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI15_EDS_Msk		0x3U << GPIO_EXTI_EDS_EXTI15_EDS_Pos
								//EXTI[15] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI14_EDS_Pos		28	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI14_EDS_Msk		0x3U << GPIO_EXTI_EDS_EXTI14_EDS_Pos
								//EXTI[14] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI13_EDS_Pos		26	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI13_EDS_Msk		0x3U << GPIO_EXTI_EDS_EXTI13_EDS_Pos
								//EXTI[13] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI12_EDS_Pos		24	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI12_EDS_Msk		0x3U << GPIO_EXTI_EDS_EXTI12_EDS_Pos
								//EXTI[12] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI11_EDS_Pos		22	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI11_EDS_Msk		0x3U << GPIO_EXTI_EDS_EXTI11_EDS_Pos
								//EXTI[11] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI10_EDS_Pos		20	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI10_EDS_Msk		0x3U << GPIO_EXTI_EDS_EXTI10_EDS_Pos
								//EXTI[10] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI9_EDS_Pos			18	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI9_EDS_Msk			0x3U << GPIO_EXTI_EDS_EXTI9_EDS_Pos
								//EXTI[9] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI8_EDS_Pos			16	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI8_EDS_Msk			0x3U << GPIO_EXTI_EDS_EXTI8_EDS_Pos
								//EXTI[8] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI7_EDS_Pos			14	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI7_EDS_Msk			0x3U << GPIO_EXTI_EDS_EXTI7_EDS_Pos
								//EXTI[7] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI6_EDS_Pos			12	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI6_EDS_Msk			0x3U << GPIO_EXTI_EDS_EXTI6_EDS_Pos
								//EXTI[6] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI5_EDS_Pos			10	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI5_EDS_Msk			0x3U << GPIO_EXTI_EDS_EXTI5_EDS_Pos
								//EXTI[5] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI4_EDS_Pos			8	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI4_EDS_Msk			0x3U << GPIO_EXTI_EDS_EXTI4_EDS_Pos
								//EXTI[4] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI3_EDS_Pos			6	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI3_EDS_Msk			0x3U << GPIO_EXTI_EDS_EXTI3_EDS_Pos
								//EXTI[3] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI2_EDS_Pos			4	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI2_EDS_Msk			0x3U << GPIO_EXTI_EDS_EXTI2_EDS_Pos
								//EXTI[2] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI1_EDS_Pos			2	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI1_EDS_Msk			0x3U << GPIO_EXTI_EDS_EXTI1_EDS_Pos
								//EXTI[1] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_EDS_EXTI0_EDS_Pos			0	//R/W: rw	ResetValue: 0x3
#define	GPIO_EXTI_EDS_EXTI0_EDS_Msk			0x3U << GPIO_EXTI_EDS_EXTI0_EDS_Pos
								//EXTI[0] 边缘触发选择
								//00: rising
								//01: falling
								//10: both
								//11: disable
								//
								
