wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gpio.h
// 14. EXTI数字滤波控制寄存器								
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_DF_DF_Pos			0	//** R/W: rw	ResetValue: 0x0
#define	GPIO_EXTI_DF_DF_Msk			0xFFFFU << GPIO_EXTI_DF_DF_Pos
								//EXTI输入数字滤波功能使能
								//0：关闭EXTI数字滤波
								//1：使能EXTI数字滤波
								//
								
// 15. EXTI中断标志寄存器							
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_ISR_IF_Pos			0	//** R/W: rw	ResetValue: 0x0
#define	GPIO_EXTI_ISR_IF_Msk			0xFFFFU << GPIO_EXTI_ISR_IF_Pos
								//外部引脚中断标志寄存器，共可以产生16个引脚中断
								//硬件置位，软件写1清零
								//
								
// 16. EXTI输入信号寄存器							
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_EXTI_DI_DI_Pos			0	//** R/W: ro	ResetValue: 0x0
#define	GPIO_EXTI_DI_DI_Msk			0xFFFFU << GPIO_EXTI_DI_DI_Pos
								//EXTI输入信号只读寄存器，软件读取此寄存器可以观察EXTI的16个输入信号的当前状态
								//注：当使能了数字滤波后，软件可以从这个寄存器读取到某个IO输入信号滤波后的状态。
								//
								
// 17. FOUT配置寄存器								
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_FOUT_SEL_FOUT1SEL_Pos			4	//R/W: rw	ResetValue: 0x0
#define	GPIO_FOUT_SEL_FOUT1SEL_Msk			0xFU << GPIO_FOUT_SEL_FOUT1SEL_Pos
#define	GPIO_FOUT_SEL_FOUT1SEL_XTLF			(0x0U << GPIO_FOUT_SEL_FOUT1SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT1SEL_RCLP			(0x1U << GPIO_FOUT_SEL_FOUT1SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT1SEL_RCHF_64			(0x2U << GPIO_FOUT_SEL_FOUT1SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT1SEL_LSCLK			(0x3U << GPIO_FOUT_SEL_FOUT1SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT1SEL_AHBCLK_64			(0x4U << GPIO_FOUT_SEL_FOUT1SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT1SEL_RTCTM			(0x5U << GPIO_FOUT_SEL_FOUT1SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT1SEL_PLLO_64			(0x6U << GPIO_FOUT_SEL_FOUT1SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT1SEL_RTCCLK_64			(0x7U << GPIO_FOUT_SEL_FOUT1SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT1SEL_APBCLK_64			(0x8U << GPIO_FOUT_SEL_FOUT1SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT1SEL_PLLO			(0x9U << GPIO_FOUT_SEL_FOUT1SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT1SEL_RC4MPSC			(0xAU << GPIO_FOUT_SEL_FOUT1SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT1SEL_RCHF			(0xBU << GPIO_FOUT_SEL_FOUT1SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT1SEL_XTHF_64			(0xCU << GPIO_FOUT_SEL_FOUT1SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT1SEL_ADCCLK_64			(0xDU << GPIO_FOUT_SEL_FOUT1SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT1SEL_CLK8K			(0xEU << GPIO_FOUT_SEL_FOUT1SEL_Pos)
								//PB12输出选择
								//0000: XTLF
								//0001: RCLP
								//0010: RCHF/64
								//0011: LSCLK
								//0100: AHBCLK/64
								//0101: RTCTM
								//0110: PLLO/64
								//0111: RTCCLK64Hz
								//1000: APBCLK/64
								//1001: PLLO
								//1010: RC4MPSC
								//1011: RCHF
								//1100: XTHF/64
								//1101: ADCCLK/64
								//1110: CLK8K
								//1111: RFU
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_FOUT_SEL_FOUT0SEL_Pos			0	//R/W: rw	ResetValue: 0x0
#define	GPIO_FOUT_SEL_FOUT0SEL_Msk			0xFU << GPIO_FOUT_SEL_FOUT0SEL_Pos
#define	GPIO_FOUT_SEL_FOUT0SEL_XTLF			(0x0U << GPIO_FOUT_SEL_FOUT0SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT0SEL_RCLP			(0x1U << GPIO_FOUT_SEL_FOUT0SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT0SEL_RCHF_64			(0x2U << GPIO_FOUT_SEL_FOUT0SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT0SEL_LSCLK			(0x3U << GPIO_FOUT_SEL_FOUT0SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT0SEL_AHBCLK_64			(0x4U << GPIO_FOUT_SEL_FOUT0SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT0SEL_RTCTM			(0x5U << GPIO_FOUT_SEL_FOUT0SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT0SEL_PLLO_64			(0x6U << GPIO_FOUT_SEL_FOUT0SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT0SEL_RTCCLK_64			(0x7U << GPIO_FOUT_SEL_FOUT0SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT0SEL_APBCLK_64			(0x8U << GPIO_FOUT_SEL_FOUT0SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT0SEL_PLLO			(0x9U << GPIO_FOUT_SEL_FOUT0SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT0SEL_RC4MPSC			(0xAU << GPIO_FOUT_SEL_FOUT0SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT0SEL_RCHF			(0xBU << GPIO_FOUT_SEL_FOUT0SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT0SEL_XTHF_64			(0xCU << GPIO_FOUT_SEL_FOUT0SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT0SEL_ADCCLK_64			(0xDU << GPIO_FOUT_SEL_FOUT0SEL_Pos)
#define	GPIO_FOUT_SEL_FOUT0SEL_CLK8K			(0xEU << GPIO_FOUT_SEL_FOUT0SEL_Pos)
								//PD11输出选择
								//0000: XTLF
								//0001: RCLP
								//0010: RCHF/64
								//0011: LSCLK
								//0100: AHBCLK/64
								//0101: RTCTM
								//0110: PLLO/64
								//0111: RTCCLK64Hz
								//1000: APBCLK/64
								//1001: PLLO
								//1010: RC4MPSC
								//1011: RCHF
								//1100: XTHF/64
								//1101: ADCCLK/64
								//1110: CLK8K
								//1111: RFU
								//
								
// 18. WKUP使能寄存器								
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_PINWKEN_WKISEL_Pos			31	//R/W: rw	ResetValue: 0x0
#define	GPIO_PINWKEN_WKISEL_Msk			0x1U << GPIO_PINWKEN_WKISEL_Pos
								//WKUPx中断入口选择
								//0：NMI中断（兼容FM385）
								//1：#39入口
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_PINWKEN_SEL_Pos			8	//R/W: rw	ResetValue: 0x0
#define	GPIO_PINWKEN_SEL_Msk			0xFFU << GPIO_PINWKEN_SEL_Pos
								//WKUP边沿选择
								//1：对应的WKUP引脚为上升沿唤醒
								//0：对应的WKUP引脚为下降沿唤醒
								//
//-----------------------------------------------------------------------------------------------------------------------------
#define	GPIO_PINWKEN_EN_Pos			0	//R/W: rw	ResetValue: 0x0
#define	GPIO_PINWKEN_EN_Msk			0xFFU << GPIO_PINWKEN_EN_Pos
								//WKUP引脚使能信号
								//1：对应的WKUP引脚功能有效
								//0：对应的WKUP引脚功能无效
								//PINWKEN[x]控制WKUPx引脚的使能
								//
/* Exported functions --------------------------------------------------------*/ 
extern void GPIOx_Deinit(GPIO_Type* GPIOx);

/* PortX输出数据寄存器 相关函数 */
extern void GPIOx_DO_Write(GPIO_Type* GPIOx, uint32_t SetValue);
extern uint32_t GPIOx_DO_Read(GPIO_Type* GPIOx);

